# Расписание занятий
import telebot
import config

week_1 = {
    'Пн': {
        1: {'time': '9:00-10:35',
            'name': 'Компьютерная графика и анимация',
            'room': 1527,
            'prof': 'Бублова Н.П.'
            },
        2: {'time': '10:45-12:20',
            'name': 'Компьютерная графика и анимация',
            'room': 1527,
            'prof': 'Бублова Н.П.'
            },
        3: {'time': '13:00-14:35',
            'name': 'Компьютерная графика и анимация',
            'room': 1527,
            'prof': 'Бублова Н.П.'
            },
        4: {'time': '14:45-16:20',
            'name': 'Компьютерная запись и обработка сигналов',
            'room': 1517,
            'prof': 'Гомон Ю.Б'
            },
        5: {'time': '16:30-18:05',
            'name': '',
            'room': '',
            'prof': ''
            },
    },
    'Вт': {
        1: {'time': '9:00-10:35',
            'name': 'Компьютерная запись и обработка видео',
            'room': 1516,
            'prof': 'Дубровина А.А.'
            },
        2: {'time': '10:45-12:20',
            'name': 'Компьютерная запись и обработка видео',
            'room': 1516,
            'prof': 'Дубровина А.А.'
            },
        3: {'time': '13:00-14:35',
            'name': '',
            'room': '',
            'prof': ''
            },
        4: {'time': '14:45-16:20',
            'name': '',
            'room': '',
            'prof': ''
            },
        5: {'time': '16:30-18:05',
            'name': '',
            'room': '',
            'prof': ''
            },
    },
    'Чт': {
        1: {'time': '9:00-10:35',
            'name': 'Инструментальные средства информационных систем',
            'room': 3312,
            'prof': 'Соколов Д.А.'
            },
        2: {'time': '10:45-12:20',
            'name': '',
            },
        3: {'time': '13:00-14:35',
            'name': '',
            'room': '',
            'prof': ''
            },
        4: {'time': '14:45-16:20',
            'name': '',
            'room': '',
            'prof': ''
            },
        5: {'time': '16:30-18:05',
            'name': '',
            'room': '',
            'prof': ''
            },
    },
    'Пт': {
        1: {'time': '9:00-10:35',
            'name': 'Программные средства интерактивных медиа',
            'room': 3312,
            'prof': 'Соколов Д.А.'
            },
        2: {'time': '10:45-12:20',
            'name': 'Инструментальные средства информационных систем',
            'room': 3312,
            'prof': 'Соколов Д.А.'
            },
        3: {'time': '13:00-14:35',
            'name': 'Инструментальные средства информационных систем',
            'room': 3312,
            'prof': 'Соколов Д.А.'
            },
        4: {'time': '14:45-16:20',
            'name': 'Переезд',
            },
        5: {'time': '16:30-18:05',
            'name': 'Создание визуальных эффектов в КиТ',
            'room': 1509,
            'prof': 'Коновалов М.В.'
            },
    },
    'Сб': {
        1: {'time': '9:00-10:35',
            'name': 'Создание визуальных эффектов',
            'room': 1528,
            'prof': 'Коновалов М.В.'
            },
        2: {'time': '10:45-12:20',
            'name': 'Создание визуальных эффектов',
            'room': 1528,
            'prof': 'Коновалов М.В.'
            },
        3: {'time': '13:00-14:35',
            'name': 'Переезд',
            'room': '',
            'prof': ''
            },
        4: {'time': '14:45-16:20',
            'name': 'Интеллектуальные системы и технологии',
            'room': 3312,
            'prof': 'Евтифиев А.О.'
            },
        5: {'time': '16:30-18:05',
            'name': 'Интеллектуальные системы и технологии',
            'room': 3312,
            'prof': 'Евтифиев А.О.'
            },
    },
}
week_2 = {
'Пн': {
        1: {'time': '9:00-10:35',
            'name': '',
            },
        2: {'time': '10:45-12:20',
            'name': 'Основы государственной культурной политики РФ',
            'room': 2503,
            'prof': 'Климин А.И.'
            },
        3: {'time': '13:00-14:35',
            'name': 'Компьютерная запись и обработка видео',
            'room': '1517',
            'prof': 'Гомон Ю.Б.'
            },
        4: {'time': '14:45-16:20',
            'name': '',
            'room': '',
            'prof': ''
            },
        5: {'time': '16:30-18:05',
            'name': '',
            'room': '',
            'prof': ''
            },
    },
'Вт': {
        1: {'time': '9:00-10:35',
            'name': 'Компьютерные музыкальные технологии',
            'room': 3549,
            'prof': 'Щекочихин А.В.'
            },
        2: {'time': '10:45-12:20',
            'name': 'Компьютерные музыкальные технологии',
            'room': 3549,
            'prof': 'Щекочихин А.В.'
            },
        3: {'time': '13:00-14:35',
            'name': 'Компьютерные музыкальные технологии',
            'room': 3549,
            'prof': 'Щекочихин А.В.'
            },
        4: {'time': '14:45-16:20',
            'name': 'Переезд',
            },
        5: {'time': '16:30-18:05',
            'name': 'Создание визуальных эффектов в КиТ',
            'room': 1535,
            'prof': 'Коновалов М.В'
            },
    },
    'Чт': {
        1: {'time': '9:00-10:35',
            'name': 'Инструментальные средства информационных систем',
            'room': 3312,
            'prof': 'Соколов Д.А.'
            },
        2: {'time': '10:45-12:20',
            'name': 'Компьютерные музыкальные технологии',
            'room': 3410,
            'prof': 'Щекочихин А.В.'
            },
        3: {'time': '13:00-14:35',
            'name': 'Инструментальные средства информационных систем',
            'room': 3312,
            'prof': 'Соколов Д.А.'
            },
        4: {'time': '14:45-16:20',
            'name': 'Инструментальные средства информационных систем',
            'room': 3312,
            'prof': 'Соколов Д.А.'
            },
        5: {'time': '16:30-18:05',
            'name': '',
            'room': '',
            'prof': ''
            },
    },
    'Пт': {
        1: {'time': '9:00-10:35',
            'name': 'Программные средства интерактивных медиа',
            'room': 3312,
            'prof': 'Соколов Д.А.'
            },
        2: {'time': '10:45-12:20',
            'name': 'Инструментальные средства информационных систем',
            'room': 3312,
            'prof': 'Соколов Д.А.'
            },
        3: {'time': '13:00-14:35',
            'name': 'Переезд',
            'room': '',
            'prof': ''
            },
        4: {'time': '14:45-16:20',
            'name': 'Компьютерная запись и обработка видео',
            'room': 1517,
            'prof': 'Дубровина А.А.'
            },
        5: {'time': '16:30-18:05',
            'name': 'Основы государственной культурной политики РФ',
            'room': 15,
            'prof': 'Климин А.И.'
            },
    },
    'Сб': {
        1: {'time': '9:00-10:35',
            'name': 'Интеллектуальные системы и технологии',
            'room': 3312,
            'prof': 'Евтифиев А.О.'
            },
        2: {'time': '10:45-12:20',
            'name': 'Интеллектуальные системы и технологии',
            'room': 3312,
            'prof': 'Евтифиев А.О.'
            },
        3: {'time': '13:00-14:35',
            'name': 'Интеллектуальные системы и технологии',
            'room': 3312,
            'prof': 'Евтифиев А.О.'
            },
        4: {'time': '14:45-16:20',
            'name': 'Интеллектуальные системы и технологии',
            'room': 3312,
            'prof': 'Евтифиев А.О.'
            },
        5: {'time': '16:30-18:05',
            'name': '',
            'room': '',
            'prof': ''
            },
    },
}
print('Добро пожаловать! Я информационная система расписания 315 группы')
def raspisanie(week):
    #print('Выберите день (Пн, Вт, Ср, Чт, Пт, Сб, Вс)')
    day = message  # ввод дня недели
    try:
        while True:
            para = (input('Введите номер пары или нажмите Enter\n'))
            if para == '':
                print(week[day])
            else:
                try:
                    print(week[day][int(para)])  # выводим информацию о паре
                    break
                except KeyError:
                    print('Неверно выбран номер пары')
                    continue
    except ValueError:
        print('Данных нет')

def run():
    while True:
        week = message
        if week == 'Четная':
            raspisanie(week_1)
            break
        elif week == 'Нечетная':
            raspisanie(week_2)
            break
        else:
            continue
run()
